# Задача 1.

# Как се нарича графиката?
# кутия с мустаци / boxplot

# Каква команда сме написали, за да я получим?
# boxplot(x2)

# Приблизително каква е стойността на най-малкото наблюдение? А на най-голямото?
# min: 1, max: 36

# Приблизително какъв процент от наблюденията са по-малки или равни на 4?
# 25%

# Приблизително какъв процент от наблюденията попадат в интервала [4, 17]?
# 50%


# Задача 2.

# p1 = вероятността произволно избрана ядка от проба с ядки да е фъстък
# p2 = вероятността произволно избрана ядка от проба с ядки да е лешник
# p3 = вероятността произволно избрана ядка от проба с ядки да е кашу
# p4 = вероятността произволно избрана ядка от проба с ядки да е бадем

# H0: (p1,p2,p3,p4) = (0.5, 0.2, 0.2, 0.1)
# H1: (p1,p2,p3,p4) != (0.5, 0.2, 0.2, 0.1)

x <- c(267, 91, 103, 39)
probs <- c(0.5, 0.2, 0.2, 0.1)
chisq.test(x, p=probs)

# p.value = 0.2144 > 0.05
# => не отхвърляме Н0
# Нямаме основание да отхвърлим хипотезата, че машината смесва ядките 
# в желаното съотношение.
# [Може да се приеме, че машината смесва ядките в желаното съотношение.]


# Задача 3.
# p = вероятността роботът да сглоби дефектен елемент
# H0: p = 0.035
# H1: p < 0.035

prop.test( x=15, n=500, p=0.035, alternative="less", correct=T )

# Верен е първият резултат!
# (alternative hypothesis: true p is less than 0.035)

# p.value = 0.3132 > 0.05
# => не отхвърляме Н0
# Нямаме основание да твърдим, че вероятността роботът да сглоби дефектен елемент 
# е по-малка от 0.035.
# [Не може да се твърди, че процентът дефектни елементи при използване на 
# робот е по-малък отколкото при сглобяване от човек.]


# Задача 4.
# mu_x = средно изминато разстояние до износване на гуми от марка 1
# mu_y = средно изминато разстояние до износване на гуми от марка 2

# H0: mu_x = mu_y
# H1: mu_x > mu_y

t.test( x, y, alternative="greater", paired=F )
t.test( x, y, alternative="greater" )

# Верен е вторият резултат!
# (alternative hypothesis: true difference in means is greater than 0)

# p.value = 0.04609 < 0.05
# => отхвърляме Н0
# Имаме основание да твърдим, че средното изминато разстояние до износване е 
# по-голямо при гумите от марка 1 в сравнение с марка 2.


# Задача 5.
# mu_1 = средна оценка по Алгебра 1
# mu_2 = средна оценка по Алгебра 2

# H0: mu_1 = mu_2
# H1: mu_1 > mu_2

t.test( a1, a2, alternative="greater", paired=T )

# Верен е първият резултат! 
# (Използва се Paired t-test, тъй като извадките са сдвоени/зависими.)

# p.value = 1.422e-05 < 0.05
# => отхвърляме Н0
# Имаме основание да твърдим, че в средно оценките по Алгебра 1 са по-високи 
# от тези по Алгебра 2.


# Задача 6.

# а) Напишете оцененото регресионно уравнение. Коя променлива е предиктор (predictor) и
# коя е отклик (response)?

# модел:
# grade = beta0 + beta1*study.hours + eps

# оценено регресионно уравнение:
# grade = 1.01617 + 0.15806*study.hours

# grade е отклик (response)
# study.hours е предиктор (predictor)

# б) Интерпретирайте оценения коефициент за предиктора.

# При един час повече подготовка за изпита оценката е по-висока 
# средно с 0.15806.

# в) Може ли да се твърди, че има линейна връзка между оценката 
# и часовете, отделени за подготовка?

# H0: beta1 = 0
# H1: beta1 != 0

# p.value = 2.9e-12 < 0.05 
# => отхвърляме Н0
# Може да се твърди, че има линейна връзка между оценката и часовете, отделени за
# подготовка.

# г) Напишете оцененото регресионно уравнение. Интерпретирайте коефициентите 
# пред предикторите.

# модел:
# grade = beta0 + beta1*study.hours + beta2*lectures + eps

# оценено регресионно уравнение:
# grade = 0.54255 + 0.14767*study.hours + 0.09432*lectures

# При един час повече подготовка за изпита и фиксиран брой посетени лекции 
# оценката е по-висока средно с 0.14767.

# При още една посетена лекция и фиксирани часове за подготовка за изпита
# оценката е по-висока средно с 0.09432.


# Задача 7. 
# fn    spec EAI DAA
# 44005 Inf  5   5
# 44007 Inf  6   6
# 80002 KN   5   4
# 80003 KN   4   4

exams <- read.table("exams.txt", header=T)
  
attach(exams)

# Факултетните номера на студентите, които имат оценка 4 или повече по ЕАИ;
fn[EAI >= 4]

# Броя на студентите от специалност КН, които имат оценка 5 по ДАА;
sum( spec=="KN" & DAA==5 )
length( which( spec=="KN" & DAA==5 ) )

# Средната оценка по ЕАИ на студентите от специалност КН;
mean( EAI[spec=="KN"] )

# Медианата на оценката по ДАА на студентите, които имат оценка 5 по ЕАИ;
median( DAA[EAI==5] )

# Похдодяща графика за успеха по ДАА в зависимост от специалността.
boxplot( DAA ~ spec )
barplot( table(DAA,spec), beside=T, legend=T )


# Задача 8.
sim.4dice <- function() {
  x <- sample( c(1:6), 4, replace=T )
  sum(x[1:2]) > sum(x[3:4])
}

rs <- replicate( 100000, sim.4dice() )
sum(rs)/length(rs)

###
